# AssignTemplateOnViewCreation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AssignTemplateOnViewCreation Property
ParameterTypeId Class See Also
---
"New views are dependent on template"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AssignTemplateOnViewCreation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AssignTemplateOnViewCreation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AssignTemplateOnViewCreation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace